In [1]:
import numpy as np
import pandas as pd

In [2]:
# creating a pandas series from a simple list

In [3]:
sci_consts = [ 3.14, 2.718, 6.69, 2.999 ]

In [4]:
type(sci_consts)

list

In [5]:
mysr = pd.Series(sci_consts)

In [6]:
mysr

0    3.140
1    2.718
2    6.690
3    2.999
dtype: float64

In [7]:
digits = [0,1,2,3,4,5,6,7,8,9]

In [8]:
pd.Series(digits)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [9]:
# strings are considred as objects
# even if one string present in list then whole list considered as object

In [10]:
names = ["Hari","Manu","Abin"]

In [11]:
pd.Series(names)

0    Hari
1    Manu
2    Abin
dtype: object

In [12]:
 # peresence of one float causes internal conversion to float

In [13]:
mix1 = [0, 2, 3.23] # dtype: float64

In [14]:
pd.Series(mix1) # by default the indexes will start from zero to n-1

0    0.00
1    2.00
2    3.23
dtype: float64

In [15]:
mix2 = [1,2,"hi"] # dtype: object

In [16]:
pd.Series(mix2)

0     1
1     2
2    hi
dtype: object

In [17]:
# creating an array of random numbers in range [0,1)

In [18]:
random_nums = np.random.rand(15)

In [19]:
random_nums

array([0.68579972, 0.07325671, 0.88596614, 0.83348595, 0.88137266,
       0.97247315, 0.98017449, 0.44363736, 0.15670654, 0.3923779 ,
       0.58566698, 0.08138414, 0.0154109 , 0.99933282, 0.10093927])

In [20]:
rand_series = pd.Series(random_nums)

In [21]:
rand_series

0     0.685800
1     0.073257
2     0.885966
3     0.833486
4     0.881373
5     0.972473
6     0.980174
7     0.443637
8     0.156707
9     0.392378
10    0.585667
11    0.081384
12    0.015411
13    0.999333
14    0.100939
dtype: float64

In [22]:
type(rand_series)

pandas.core.series.Series

In [23]:
myarr = np.arange(1,30+1).reshape(6,5) # an array having 1 to 30 numbers

In [24]:
myarr

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10],
       [11, 12, 13, 14, 15],
       [16, 17, 18, 19, 20],
       [21, 22, 23, 24, 25],
       [26, 27, 28, 29, 30]])

In [25]:
myarr.size

30

In [26]:
myarr.shape

(6, 5)

In [27]:
mydf = pd.DataFrame(myarr, index = range(6))

In [28]:
mydf

    0   1   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15
3  16  17  18  19  20
4  21  22  23  24  25
5  26  27  28  29  30

In [29]:
np.linspace(0.1,1,10)

array([0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9, 1. ])

In [30]:
"""index = np.linspace(0.1,0.5,5)"""

'index = np.linspace(0.1,0.5,5)'

In [31]:
testdf = pd.DataFrame(np.empty((9,5),dtype=int), index = np.linspace(0.2, 1.8, 9))

In [32]:
testdf.columns = ("A","B","C","D","E") # changing the index of the columns

In [33]:
testdf

,A,B,C,D,E
0.2,94289272241000,0,139803135610416,139803135411952,139803113652528
0.4,139803113467008,139803134826224,139803113652672,139803135006832,139803134833008
0.6,139803113652784,139803113652976,139803113653232,139803113653424,139803113641008
0.8,139803135136880,139803135788528,139803113653744,139803113653808,139803124634800
1.0,139803113654000,139803113654064,139803113654320,139803113654400,139803134825456
1.2,139803134831600,139803134825520,139803134825584,139803134825648,139803134825392
1.4,139803134515696,139803134104560,139803134821552,139803135133680,139803134787760
1.6,139803133890480,139803134584880,139803114847792,139803135411120,139803135406960
1.8,139803135260720,139803134832688,139803135144880,139803134834224,368

In [34]:
# Acessing the values

In [35]:
testdf['A'][0.4]

139803113467008

In [36]:
testdf.T # taking transpose of the dataframe

,0.2,0.4,0.6,0.8,1.0,1.2,1.4,1.6,1.8
A,94289272241000,139803113467008,139803113652784,139803135136880,139803113654000,139803134831600,139803134515696,139803133890480,139803135260720
B,0,139803134826224,139803113652976,139803135788528,139803113654064,139803134825520,139803134104560,139803134584880,139803134832688
C,139803135610416,139803113652672,139803113653232,139803113653744,139803113654320,139803134825584,139803134821552,139803114847792,139803135144880
D,139803135411952,139803135006832,139803113653424,139803113653808,139803113654400,139803134825648,139803135133680,139803135411120,139803134834224
E,139803113652528,139803134833008,139803113641008,139803124634800,139803134825456,139803134825392,139803134787760,139803135406960,368

In [37]:
newdf = pd.DataFrame(np.random.rand(300,6),index = np.arange(300))

In [38]:
newdf

            0         1         2         3         4         5
0    0.357639  0.413809  0.914230  0.112138  0.180895  0.794762
1    0.549146  0.755584  0.333722  0.462887  0.818644  0.941976
2    0.053611  0.031760  0.142191  0.986711  0.317914  0.057681
3    0.539467  0.479716  0.623971  0.220219  0.043050  0.194866
4    0.952016  0.439789  0.496625  0.767611  0.196192  0.901185
..        ...       ...       ...       ...       ...       ...
295  0.316267  0.215729  0.820555  0.711764  0.423014  0.361745
296  0.379220  0.266539  0.360699  0.856993  0.292892  0.709032
297  0.659804  0.443282  0.526278  0.045622  0.851947  0.677020
298  0.101283  0.591223  0.651709  0.394781  0.287535  0.678117
299  0.018376  0.574222  0.948061  0.429952  0.568233  0.069313

[300 rows x 6 columns]

In [39]:
type(newdf)

pandas.core.frame.DataFrame

In [40]:
newdf.describe()

                0           1           2           3           4           5
count  300.000000  300.000000  300.000000  300.000000  300.000000  300.000000
mean     0.486330    0.486124    0.498493    0.510599    0.487709    0.483970
std      0.268055    0.291861    0.296479    0.282264    0.289278    0.281900
min      0.007088    0.002950    0.000165    0.001130    0.003485    0.011507
25%      0.267382    0.223942    0.232823    0.274848    0.244081    0.233065
50%      0.467757    0.489746    0.501046    0.539850    0.482044    0.488386
75%      0.703702    0.754868    0.753768    0.741595    0.744401    0.733402
max      0.999769    0.989640    0.996479    0.997351    0.991346    0.999086

In [41]:
newdf.head(8)

          0         1         2         3         4         5
0  0.357639  0.413809  0.914230  0.112138  0.180895  0.794762
1  0.549146  0.755584  0.333722  0.462887  0.818644  0.941976
2  0.053611  0.031760  0.142191  0.986711  0.317914  0.057681
3  0.539467  0.479716  0.623971  0.220219  0.043050  0.194866
4  0.952016  0.439789  0.496625  0.767611  0.196192  0.901185
5  0.222943  0.313437  0.130480  0.150448  0.302517  0.881642
6  0.396002  0.577276  0.284766  0.774095  0.922270  0.295996
7  0.934156  0.300363  0.141506  0.452122  0.876696  0.747810

In [42]:
newdf.tail(8)

            0         1         2         3         4         5
292  0.591536  0.136162  0.229616  0.882444  0.886938  0.195924
293  0.537411  0.470589  0.319966  0.536877  0.538548  0.627580
294  0.741159  0.765648  0.144951  0.618280  0.225842  0.174061
295  0.316267  0.215729  0.820555  0.711764  0.423014  0.361745
296  0.379220  0.266539  0.360699  0.856993  0.292892  0.709032
297  0.659804  0.443282  0.526278  0.045622  0.851947  0.677020
298  0.101283  0.591223  0.651709  0.394781  0.287535  0.678117
299  0.018376  0.574222  0.948061  0.429952  0.568233  0.069313

In [43]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
5    float64
dtype: object

In [44]:
newdf[5][115]

0.49089570432187457

In [45]:
# mutating the data-frame, raises a warning though
newdf[5][3] = "Hii"
newdf[1][1] = "Tq"

/tmp/ipykernel_72377/732091781.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf[1][1] = "Tq"

In [46]:
newdf

            0         1         2         3         4         5
0    0.357639  0.413809  0.914230  0.112138  0.180895  0.794762
1    0.549146        Tq  0.333722  0.462887  0.818644  0.941976
2    0.053611   0.03176  0.142191  0.986711  0.317914  0.057681
3    0.539467  0.479716  0.623971  0.220219  0.043050       Hii
4    0.952016  0.439789  0.496625  0.767611  0.196192  0.901185
..        ...       ...       ...       ...       ...       ...
295  0.316267  0.215729  0.820555  0.711764  0.423014  0.361745
296  0.379220  0.266539  0.360699  0.856993  0.292892  0.709032
297  0.659804  0.443282  0.526278  0.045622  0.851947   0.67702
298  0.101283  0.591223  0.651709  0.394781  0.287535  0.678117
299  0.018376  0.574222  0.948061  0.429952  0.568233  0.069313

[300 rows x 6 columns]

In [47]:
newdf.dtypes

0    float64
1     object
2    float64
3    float64
4    float64
5     object
dtype: object

In [48]:
newdf.columns

RangeIndex(start=0, stop=6, step=1)

In [49]:
myarr

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10],
       [11, 12, 13, 14, 15],
       [16, 17, 18, 19, 20],
       [21, 22, 23, 24, 25],
       [26, 27, 28, 29, 30]])

In [50]:
myarr.T # taking transpose of an array

array([[ 1,  6, 11, 16, 21, 26],
       [ 2,  7, 12, 17, 22, 27],
       [ 3,  8, 13, 18, 23, 28],
       [ 4,  9, 14, 19, 24, 29],
       [ 5, 10, 15, 20, 25, 30]])

In [51]:
arrdf = pd.DataFrame(myarr)

In [52]:
arrdf

    0   1   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15
3  16  17  18  19  20
4  21  22  23  24  25
5  26  27  28  29  30

In [53]:
arrdf.loc[0] # returns first row

0    1
1    2
2    3
3    4
4    5
Name: 0, dtype: int64

In [54]:
arrdf.loc[0, 2] # returns first row, third column

3

In [55]:
arrdf.loc[0,5] = 123 # non- =existent column will be created

In [56]:
arrdf

    0   1   2   3   4      5
0   1   2   3   4   5  123.0
1   6   7   8   9  10    NaN
2  11  12  13  14  15    NaN
3  16  17  18  19  20    NaN
4  21  22  23  24  25    NaN
5  26  27  28  29  30    NaN

In [57]:
arrdf.drop(5, axis = 0) # axis 0 refers to rows and index 5 means row index 5

    0   1   2   3   4      5
0   1   2   3   4   5  123.0
1   6   7   8   9  10    NaN
2  11  12  13  14  15    NaN
3  16  17  18  19  20    NaN
4  21  22  23  24  25    NaN

In [58]:
arrdf.drop(5, axis = 1) # axis 1 refers to column and index 5 means column index 5

    0   1   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15
3  16  17  18  19  20
4  21  22  23  24  25
5  26  27  28  29  30

In [59]:
arrdf.columns = ['a', 'b', 'c', 'd', 'e']

ValueError: Length mismatch: Expected axis has 6 elements, new values have 5 elements

In [ ]:
arrdf

In [ ]:
arrdf.loc[[1,3],['b','d']] # specific portion of the data frame